bat
btop
perl-image-exiftool
eza
fd
fzf
github-cli
git
lazygit
less
neovim
nvm
openssh
pyenv
ripgrep
rsync
starship
tldr
tmux
tree
vivid
wget
yubikey-manager
zoxide
